Ran Plan for dir: `TerminalServer01` workspace: `default`

<details><summary>Show Output</summary>

```diff
proxmox_vm_qemu.TerminalServer01: Refreshing state... [id=pve01/qemu/200]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # proxmox_vm_qemu.TerminalServer01 will be updated in-place
~ resource "proxmox_vm_qemu" "TerminalServer01" {
      ~ cores                     = 4 -> 2
      + default_ipv4_address      = (known after apply)
        id                        = "pve01/qemu/200"
      ~ memory                    = 8192 -> 2048
        name                      = "TerminalServer01"
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      ~ vm_state                  = "stopped" -> "running"
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d TerminalServer01`
* :put_litter_in_its_place: To **delete** this plan click [here](https://51ee-94-62-39-105.ngrok-free.app/lock?id=AlexDias95%252FAlexDiasHomelab-IaaS%252FTerminalServer01%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d TerminalServer01`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`